In [2]:
#CMS Pandas Tutorials 9

In [3]:
import pandas as pd
import numpy as np

In [4]:
people = {
    'first':['Debasis', 'Jane', 'John', 'Chirs', np.nan, None, 'NA'],
    'last':['Nath', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email':['debasisnath@outlook.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'ananomaous@email.com', None],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [5]:
df0 = pd.DataFrame(people)

In [6]:
df0

     first     last                    email      age
0  Debasis     Nath  debasisnath@outlook.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chirs  Schafer                     None       36
4      NaN      NaN                      NaN     None
5     None      NaN     ananomaous@email.com     None
6       NA  Missing                     None  Missing

In [7]:
df0.dropna()

     first  last                    email age
0  Debasis  Nath  debasisnath@outlook.com  33
1     Jane   Doe        JaneDoe@email.com  55
2     John   Doe        JohnDoe@email.com  63

In [8]:
df0.dropna(axis='index', how='any')

     first  last                    email age
0  Debasis  Nath  debasisnath@outlook.com  33
1     Jane   Doe        JaneDoe@email.com  55
2     John   Doe        JohnDoe@email.com  63

In [31]:
df0.dropna(axis='index', how='any', subset=['email', 'last'], inplace=True)

In [32]:
df0.replace('NA', np.nan, inplace=True)
df0.replace('Missing', np.nan, inplace=True)

In [33]:
df0

     first  last                    email   age
0  Debasis  Nath  debasisnath@outlook.com  33.0
1     Jane   Doe        JaneDoe@email.com  55.0
2     John   Doe        JohnDoe@email.com  63.0

In [34]:
df0.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

In [35]:
df0.fillna('MISSING')

     first  last                    email   age
0  Debasis  Nath  debasisnath@outlook.com  33.0
1     Jane   Doe        JaneDoe@email.com  55.0
2     John   Doe        JohnDoe@email.com  63.0

In [36]:
df0.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [15]:
type(np.nan)

float

In [16]:
df0['age'] = df0['age'].astype(float)

In [17]:
df0

     first     last                    email   age
0  Debasis     Nath  debasisnath@outlook.com  33.0
1     Jane      Doe        JaneDoe@email.com  55.0
2     John      Doe        JohnDoe@email.com  63.0
3    Chirs  Schafer                     None  36.0
4      NaN      NaN                      NaN   NaN
5     None      NaN     ananomaous@email.com   NaN
6      NaN      NaN                     None   NaN

In [18]:
df0.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [19]:
df0['age'].mean()

46.75

In [20]:
df0['age'].median()

45.5

In [21]:
na_vals = ['NA', 'Missing']
df = pd.read_csv('data/survey_results_public.csv', na_values=na_vals )
schema_df = pd.read_csv('data/survey_results_schema.csv')

In [22]:
pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 85)

In [23]:
 df['YearsCode']

0          4
1        NaN
2          3
3          3
4         16
        ...
88878    NaN
88879    NaN
88880    NaN
88881    NaN
88882      8
Name: YearsCode, Length: 88883, dtype: object

In [24]:
 df['YearsCode'].astype(float)

ValueError: could not convert string to float: 'Less than 1 year'

In [25]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [26]:
df['YearsCode'].replace('Less than 1 year', 0, inplace=True)
df['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [27]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [28]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [29]:
df['YearsCode'].median()

9.0